In [2]:
# import required libraries
import openpyxl
import csv
import pandas as pd

In [ ]:
excel_file_path = 'C/Users/HP/Desktop/DATASCI/PERSONAL/KPMG virtual internship/kpmg_sprocket.xlsx'
sheet_names = ['Transactions', 'NewCustomerList', 'CustomerDemographic', 'CustomerAdress']

In [4]:
import pandas as pd
import os

def excel_to_csv(excel_file_path, sheet_names=None, csv_file_names=None):
    excel_file_path = os.path.abspath(excel_file_path)  # Convert to absolute path
    xls = pd.ExcelFile(excel_file_path)

    if csv_file_names is None:
        csv_file_names = [sheet_name for sheet_name in xlsx.sheet_names]

    if len(csv_file_names) != len(xls.sheet_names):
        raise ValueError("Number of CSV file names must match the number of sheets in the Excel file.")

    for sheet_name, csv_name in zip(xls.sheet_names, csv_file_names):
        df = xls.parse(sheet_name)
        csv_file_path = f'{csv_name}.csv'  # Save each sheet with the provided CSV file name
        df.to_csv(csv_file_path, index=False)

    print("Conversion completed!")

# Call the function to convert the Excel file to CSV with custom names for each sheet
excel_file_path = 'C:/Users/HP/Desktop/DATASCI/PERSONAL/KPMG virtual internship/kpmg_sprocket.xlsx'
sheet_names = None  # Set this to a list of specific sheet names if you want to convert only certain sheets.
csv_file_names = ['Transactions', 'NewCustomerList', 'CustomerDemographic', 'CustomerAdress']  # Provide the desired CSV file names

excel_to_csv(excel_file_path, sheet_names, csv_file_names)

C:\Users\HP\AppData\Local\Temp\ipykernel_22572\615698400.py:15: FutureWarning: Inferring datetime64[ns] from data containing strings is deprecated and will be removed in a future version. To retain the old behavior explicitly pass Series(data, dtype=datetime64[ns])
  df = xls.parse(sheet_name)
C:\Users\HP\AppData\Local\Temp\ipykernel_22572\615698400.py:15: FutureWarning: Inferring datetime64[ns] from data containing strings is deprecated and will be removed in a future version. To retain the old behavior explicitly pass Series(data, dtype=datetime64[ns])
  df = xls.parse(sheet_name)

Conversion completed!

In [9]:
transactions_df = pd.read_csv("Transactions_1.csv")
transactions_df.head()

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
0,1,2,2950,2/25/2017,0.0,Approved,Solex,Standard,medium,medium,71.49,53.62,41245.0
1,2,3,3120,5/21/2017,1.0,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92,41701.0
2,3,37,402,10/16/2017,0.0,Approved,OHM Cycles,Standard,low,medium,1793.43,248.82,36361.0
3,4,88,3135,8/31/2017,0.0,Approved,Norco Bicycles,Standard,medium,medium,1198.46,381.10,36145.0
4,5,78,787,10/1/2017,1.0,Approved,Giant Bicycles,Standard,medium,large,1765.30,709.48,42226.0

In [11]:
transactions_df.isnull().sum()

transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order               360
order_status                 0
brand                      197
product_line               197
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

In [12]:
transactions_df.duplicated().sum()

0

In [13]:
CustomerList_df = pd.read_csv('NewCustomerList_2.csv')
CustomerList_df.head()

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,...,state,country,property_valuation,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Rank,Value
0,Chickie,Brister,Male,86,7/12/1957,General Manager,Manufacturing,Mass Customer,N,Yes,...,QLD,Australia,6,0.52,0.65,0.8125,0.690625,1,1,1.718750
1,Morly,Genery,Male,69,3/22/1970,Structural Engineer,Property,Mass Customer,N,No,...,NSW,Australia,11,0.94,0.94,1.1750,0.998750,1,1,1.718750
2,Ardelis,Forrester,Female,10,8/28/1974,Senior Cost Accountant,Financial Services,Affluent Customer,N,No,...,VIC,Australia,5,0.52,0.52,0.5200,0.520000,1,1,1.718750
3,Lucine,Stutt,Female,64,1/28/1979,Account Representative III,Manufacturing,Affluent Customer,N,Yes,...,QLD,Australia,1,0.88,1.10,1.1000,1.100000,4,4,1.703125
4,Melinda,Hadlee,Female,34,9/21/1965,Financial Analyst,Financial Services,Affluent Customer,N,No,...,NSW,Australia,9,0.53,0.53,0.6625,0.662500,4,4,1.703125

In [14]:
CustomerList_df.isnull().sum()

first_name                               0
last_name                               29
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     17
job_title                              106
job_industry_category                  165
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                   0
address                                  0
postcode                                 0
state                                    0
country                                  0
property_valuation                       0
Unnamed: 16                              0
Unnamed: 17                              0
Unnamed: 18                              0
Unnamed: 19                              0
Unnamed: 20                              0
Rank                                     0
Value                                    0
dtype: int64

In [15]:
CustomerList_df.duplicated().sum()

0

In [16]:
CustomerDemographic_df = pd.read_csv('CustomerDemographic_3.csv')
CustomerDemographic_df.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
0,1,Laraine,Medendorp,F,93,10/12/1953,Executive Secretary,Health,Mass Customer,N,"""'",Yes,11.0
1,2,Eli,Bockman,Male,81,12/16/1980,Administrative Officer,Financial Services,Mass Customer,N,<script>alert('hi')</script>,Yes,16.0
2,3,Arlin,Dearle,Male,61,1/20/1954,Recruiting Manager,Property,Mass Customer,N,2/1/2018 0:00,Yes,15.0
3,4,Talbot,NaN,Male,33,10/3/1961,NaN,IT,Mass Customer,N,() { _; } >_[$($())] { touch /tmp/blns.shellsh...,No,7.0
4,5,Sheila-kathryn,Calton,Female,56,5/13/1977,Senior Editor,NaN,Affluent Customer,N,NIL,Yes,8.0

In [17]:
CustomerDemographic_df.isnull().sum()

customer_id                              0
first_name                               0
last_name                              125
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     87
job_title                              506
job_industry_category                  656
wealth_segment                           0
deceased_indicator                       0
default                                302
owns_car                                 0
tenure                                  87
dtype: int64

In [18]:
CustomerDemographic_df.duplicated().sum()

0

In [19]:
CustomerAddress_df = pd.read_csv("CustomerAddress_4.csv")

In [20]:
CustomerAddress_df.isnull().sum()

customer_id           0
address               0
postcode              0
state                 0
country               0
property_valuation    0
dtype: int64

In [21]:
CustomerAddress_df.duplicated().sum()

0